import TextLintTester from "textlint-tester";
import rule from "../src/index";

const tester = new TextLintTester();
// ruleName, rule, { valid, invalid }
tester.run("rule", rule, {
    valid: [
        "قال للبائع: «أريد خبزاً و» ولكنه لم يكمل",
        'قال للبائع: "أريد خبزاً و" ولكنه لم يكمل',
        "ساعدت الفيزياء الجيوليجيين في الكشف عن عدد كبير من مكامن النحاس والحديد والنفط والفحم والماء والملح ومواد البناء وغيرها."
    ],
    invalid: [
        {
            text: `مرحباً  و أهلاً`,
            output: "مرحباً وأهلاً",
            errors: [{ range: [5, 11] }]
        },
        {
            text: `ساعدت الفيزياء الجيوليجيين في الكشف عن عدد كبير من مكامن النحاس و الحديد  و النفط و الفحم و   الماء و الملح  و مواد البناء و  غيرها.`,
            output: "ساعدت الفيزياء الجيوليجيين في الكشف عن عدد كبير من مكامن النحاس والحديد والنفط والفحم والماء والملح ومواد البناء وغيرها.",
            errors: [
                {
                    range: [62, 67]
                },
                {
                    range: [71, 77]
                },
                {
                    range: [80, 85]
                },
                {
                    range: [88, 95]
                },
                {
                    range: [98, 103]
                },
                {
                    range: [106, 112]
                },
                {
                    range: [121, 127]
                }
            ]
        }
    ]
});
